
const log_lvl = 2;


const nodaAnsw = [      'Шито?', 
                        'Отстань, я занята...', 
                        'Ну шо такое?', 'Хватит меня звать ._.', 
                        'Ваще то моё полное имя - Нода тян',
                        'Ась?',
                        'Шо надо то?',
                        'Слушаю:3',
                        'Как банный лист пристал...' ];

const confusedAnsw = [  'Cложно, сложно, ни**я не понятно.',
                        'Чееего *лять?',
                        'Ни**я не поняла, но очень интересно:3',
                        'Чот я ничего не поняла',
                        'А можно помедленее? Я записываю...' ];

const bjMessage = {
    title: [':x: Не хватает монет',],
    color: [0xEF5350,],
    description: [`Ваша ставка привысила размер вашего кошелька\n\nВаш баланс:`,]
}

module.exports = { log_lvl, nodaAnsw, confusedAnsw};