const buy_question = {
    'title': `Нода-шоп!`, 
    'color': 0xebe134, 
    'description': `
            Ваш баланс монет: {0}
            Купить общий вопрос: 25 чеканных монет
            Купить личный вопрос: 100 чеканных монет

            Для покупки общего вопроса напишите: !общий вопрос
            Для покупки личного вопроса напишите: !личный вопрос
            ` ,
    'footer': '' 
};

const buy_common_question = {
    'title': `Покупка общего вопроса.`, 
    'color': 0xebe134, 
    'description': `
            Ваш баланс монет: {0}
            Для покупки вопроса напишите или лучше скопируйте как шаблон:
            !вопрос [Тут пишите ваш вопрос, обязательно в квадратных скобочках] [А тут ваш ответ, так же в квадратных скобочках]
            `,
    'footer': '' 
};

const buy_question_den = {
    'title': `Отказано.`, 
    'color': 0xFF0000, 
    'description': `
            Не хватает чеканных монет, ваш баланс: {0}
            `,
    'footer': '' 
};

const buy_personal_question = {
    'title': `Покупка личного вопроса.`, 
    'color': 0xebe134, 
    'description': `
            Ваш баланс монет: {0}
            Для покупки вопроса напишите или лучше скопируйте как шаблон:
            !вопрос [Тут пишите ваш вопрос, обязательно в квадратных скобочках] [А тут ваш ответ, так же в квадратных скобочках] [личный]
            `,
    'footer': '' 
};

const daily_message = {
    'title': '🎁 Ежедневная отметка', 
    'color': 0x009900, 
    'description': `
            Получено \`50\` чеканных монет 
            `,
    'footer': `Ваши монетки: {0}`, 
};

const daily_message_den = {
    'title': '🃖 Слишком рано', 
    'color': 0xEF5350, 
    'description': `
            С момента последней отметки прошло меньше суток.
            
            Времени осталось - \`{0}:{1}:{2}\`
            `,
    'footer': '',
};

const inc_question = {
    'title': `Ошибка`, 
    'color': 0xFF0000, 
    'description': `
                Вы неправильно указали тип вопроса.
                Для покупки личного вопроса, в конце оформления покупки обычного вопроса допишите [личный].
                Для покупки общего вопроса можно вообще не писать тип вопроса или напишите [общий]
                `,
    'footer': '',
};

const quest_bought = {
    'title': `Покупка оформлена.`, 
    'color': 0x36D904, 
    'description': `
            Ваш вопрос: {0}
            Ваш ответ: {1}
            Тип вопроса: {2}
            Осталось чеканных монет: {3}
            Приятного использования😘
            `,
    'footer': '',
};

const profile = {
    'title': `Профиль игрока: {0}`, 
    'color': 0x0a4bff, 
    'description': `
        :trophy:LVL: {0}
        :jigsaw:XP: {1}
        Чеканных монет: {2} :moneybag:
        :key:Общих вопросов куплено: {3}
        `,
    'footer': '',
};

const give_coins = {
    'title': `Запрос халявных монеток`, 
    'color': 0x36D904, 
    'description': `
        Держи 100 монеток :moneybag:
        Чеканных монет: {0} 
        `,
    'footer': '',
};

const bj = {
    'title': ':x: Не хватает аргументов', 
    'color': 0xEF5350, 
    'description': `Используйте \`!бж ставка 25\`\n\nСумма ставки может быть любой\n
                            \`!бж хелп\` - что бы посмотреть правила игры.`,
    'footer': '',
};

const help = {
    'title': `Список команд бота`, 
    'color': 0x36D904, 
    'description': `
        Нода - можно получить рандомный ответ на обращение к боту 
        !профиль - посмотреть свой профиль у ноды
        !кубик - кинуть кости от 1 до 10
        !монетки - получить 100 монеток(временная функция для тестеров)
        !купить вопрос - зайти в шоп, для покупки вопросов
        !общий вопрос - гайд по покупке обших вопросов
        !личный вопрос - гайд по покупке личных вопросов
        !бж - играть в блэкджек с нодой
        !(п)осчитай - калькулятор
        !листья 1000 - конвертер листьев в голду
        !дейлик - получить ежедневные монетки 50 
        `,
    'footer': '',
};

const bj_no_money = {
    'title': ':x: Не хватает монет', 
    'color': 0xEF5350, 
    'description': `Ваша ставка привысила размер вашего кошелька\n\nВаш баланс: {0}`,
    'footer': '',
};

const bj_no_money_double = {
    'title': ':x: Не хватает монет', 
    'color': 0xEF5350, 
    'description': `У вас в кошельке не хватает монет для удвоения\n\nВаш баланс: {0}`,
    'footer': '',
};

const bj_inc_bet = {
    'title': ':x: Не хватает аргументов', 
    'color': 0xEF5350, 
    'description': `Вы не указали сумму ставки\n\nИспользуйте \`!бж ставка 25\`\n\nСумма ставки может быть любой`,
    'footer': '',
}

const bj_help = {
    'title': 'Правила игры: Блэкджек', 
    'color': 0x202225, 
    'description': `Цель игры - набрать 21 очко или набрать больше очков,
                                    чем Нода, но не больше 21.\n
                                    Начать игру вы можете, написав \`!бж ставка 25\`,
                                    сумма ставки может быть любой.\n
                                    В начале игры вам в руку приходят 2 карты, а в руку Ноды
                                    одна. Именно на этом ходу вы можете удвоить свою ставку,
                                    написав \`!бж удвоить\`. Это действие сразу передает ход
                                    Ноде и его можно сделать только в самом начале игры.\n
                                    Если вы не хотите удваивать, можете добрать еще карту,
                                    написав \`!бж еще\`.\n
                                    Когда вы наберете нужное количество карт, на ваш взгляд,
                                    вы можете передать ход ноде, написав \`!бж хватит\`.\n
                                    Вы так же можете в любой момент игры, до её конца,
                                    забрать половину вашей ставки - \`!бж пасс\`. `,
    'footer': '',
};

const bj_surrender_er = {
    'title': ':x: Нарушение правил игры', 
    'color': 0xEF5350, 
    'description': `Вы можете забрать половину ставки только
                    на первичной раздаче.
                    \nСейчас доступно \`!бж еще\` и \`!бж хватит\``,
    'footer': '',
};

const bj_double_er = {
    'title': ':x: Нарушение правил игры', 
    'color': 0xEF5350, 
    'description': `Вы можете удвоить ставку только на первичной раздаче.
                    \nСейчас доступно \`!бж еще\` и \`!бж хватит\``,
    'footer': '',
};

const temp = {
    'title': 'title', 
    'color': 0xFF0000, 
    'description': `descroption`,
    'footer': '',
};

module.exports = {
    buy_question,
    buy_common_question,
    buy_question_den,
    buy_personal_question,
    daily_message,
    daily_message_den,
    inc_question,
    quest_bought,
    profile,
    give_coins,
    bj,
    bj_double_er,
    bj_surrender_er,
    bj_help,
    bj_inc_bet,
    bj_no_money_double,
    bj_no_money,
    help,
}
